#include <stdio.h>

int main() {
    
    int n;
    printf("Введите число n:\n");
    scanf("%d", &n); 
    
    /*
    Число n, например 4, переводтся в 2 систему. n - 1 тоже переводится (будет 3)
    4 в двочиной = 100, 3 в двоичной = 011
    Программа сравнавает поочерёдно цифры чисел, и там, где совпадают единицы он подставляет их
    В данном случае единницы не совпадают и в переменной будет 0
    Вывод будет 1.
    Если n будет 5, а n - 1 будет 4, в двоичной 5 - 101, а 4 - 100.
    Единицы совпадают лишь в одном месте и будет новое число 100 в двоичной или 4 в 10.
    Вывод будет 0
    */
    n &= n - 1;
    
    printf("%d", (n  & (n - 1)) == 0);
    return 0;
}
